Re-merging data because of lost data

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import re

In [2]:
# data merged, includes hd2017, effy2017, diverse_ind, intl_pct
data = pd.read_csv('Data/Data Merged.csv')
#data.head()

C:\Users\Ning\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3049: DtypeWarning: Columns (106,137) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [40]:
# US News etc, includes US news ranking, list of good international universities, out of state tuition,
# calculated various graduation rates etc
usnews274 = pd.read_csv('Data/US News etc 274.csv')

In [42]:
data_merged = pd.merge(data, usnews274, how = 'left', on = 'UNITID')
data_merged.head()
data_merged.shape

(3221, 173)

# calculate graduation rate

In [5]:
pd.merge?

In [6]:
#calculating graducation rate
gr = pd.read_csv('Data/gr2017.csv')
gr_4yr = gr[gr.GRTYPE == 3] # completers
gr_cohort = gr[gr.GRTYPE == 2] # adjusted cohort
gr = pd.merge(gr_4yr, gr_cohort, on = 'UNITID', suffixes=('_num', '_denom'))

In [7]:
var_names = gr_4yr.columns[7:]
#print(var_names)
cal_names = []
for var_name in var_names:
    m = re.search('\AGR\w+', var_name)
    if m:
        cal_names.append(m.group(0))
print(cal_names)
cal_names[-1] = 'GRNRALW '

['GRTOTLT', 'GRTOTLM', 'GRTOTLW', 'GRAIANT', 'GRAIANM', 'GRAIANW', 'GRASIAT', 'GRASIAM', 'GRASIAW', 'GRBKAAT', 'GRBKAAM', 'GRBKAAW', 'GRHISPT', 'GRHISPM', 'GRHISPW', 'GRNHPIT', 'GRNHPIM', 'GRNHPIW', 'GRWHITT', 'GRWHITM', 'GRWHITW', 'GR2MORT', 'GR2MORM', 'GR2MORW', 'GRUNKNT', 'GRUNKNM', 'GRUNKNW', 'GRNRALT', 'GRNRALM', 'GRNRALW']

In [8]:
for name in cal_names:
    var2 = (name+'_denom') # cohort
    var3 = (name+'_num') # completers
    var_rate = (name+'_rate')
    gr[var_rate] = gr[var3]/gr[var2]
    gr[var_rate][gr[var3] == 0] = 0

gr.head()

C:\Users\Ning\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,UNITID,GRTYPE_num,CHRTSTAT_num,SECTION_num,COHORT_num,LINE_num,XGRTOTLT_num,GRTOTLT_num,XGRTOTLM_num,GRTOTLM_num,...,GRWHITW_rate,GR2MORT_rate,GR2MORM_rate,GR2MORW_rate,GRUNKNT_rate,GRUNKNM_rate,GRUNKNW_rate,GRNRALT_rate,GRNRALM_rate,GRNRALW _rate
0,100654,3,13,1,1,999,R,201,R,83.0,...,0.500000,0.333333,0.333333,0.333333,0.000000,0.000000,0.0,0.000000,0.000000,0.000000
1,100663,3,13,1,1,999,R,834,R,306.0,...,0.597701,0.444444,0.346154,0.500000,0.454545,0.500000,0.0,0.590909,0.461538,0.777778
2,100690,3,13,1,1,999,R,2,R,2.0,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.0,0.000000,0.000000,0.000000
3,100706,3,13,1,1,999,R,317,R,174.0,...,0.538012,0.666667,0.000000,1.000000,0.551724,0.526316,0.6,0.571429,0.615385,0.000000
4,100724,3,13,1,1,999,R,304,R,121.0,...,0.200000,0.000000,0.000000,0.000000,0.333333,0.000000,0.5,0.428571,0.400000,0.500000

In [14]:
data_merged = pd.merge(data_merged, gr, how = 'left', on = 'UNITID')

In [16]:
list(data_merged.columns)
data_merged.to_csv('Data/Data Merged.csv')

# adding internationalstudent.com

In [3]:
data_merged = pd.read_csv('Data/Data Merged.csv')
data_merged.head()

,UNITID,EFFYLEV,LSTUDY,XEYTOTLT,EFYTOTLT,XEYTOTLM,EFYTOTLM,XEYTOTLW,EFYTOTLW,XEFYAIAT,...,WEBADDR_cleaned,annual_cost,avg_award,inst_name,intl_awarded,link,state_init,state_name,total_intl,link_cleaned
0,100654,2,1,R,5207,R,2286,R,2921,R,...,aamu.edu,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,100663,2,1,R,13308,R,5528,R,7780,R,...,uab.edu,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,100706,2,1,R,7519,R,4287,R,3232,R,...,uah.edu,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,100724,2,1,R,5229,R,2024,R,3205,R,...,alasu.edu,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,100751,2,1,R,35625,R,15883,R,19742,R,...,ua.edu,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [43]:
scholarship = pd.read_csv('Data/InternationalStudent_com.csv')
scholarship.head()
scholarship.shape

(332, 8)

In [7]:
from fuzzywuzzy import fuzz
print(scholarship.inst_name[1])
print(data_merged.INSTNM[9])
fuzz.ratio(scholarship.inst_name[1], data_merged.INSTNM[9])

Harding University
Harding University

100

In [44]:
len(set(scholarship.inst_name) & set(data_merged.INSTNM))
# 246 exact same names

246

'http://www.coloradocollege.edu'

In [45]:
# try matching url
url1 = data_merged.WEBADDR
url1_cleaned = []
for url in url1:
    url = url.lower()
    url = re.sub('http://','', url)
    url = re.sub('https://','', url)
    url = re.sub('www.','',url)
    url = re.sub('/','', url)
    url1_cleaned.append(url)
#url1_cleaned

In [50]:
data_merged.loc[:,'WEBADDR_cleaned'] = url1_cleaned

In [52]:
#data_merged.head()

In [34]:
url2 = scholarship.link
url2_cleaned = []
for url in url2:
    url = url.lower()
    url = re.sub('http://','', url)
    url = re.sub('https://','', url)
    url = re.sub('http//','', url)
    url = re.sub('www.','',url)
    url = re.sub('.edu\D+','.edu', url)
    url = re.sub('admissions.','',url)
    url2_cleaned.append(url)
#url2_cleaned

In [53]:
scholarship.loc[:,'link_cleaned'] = url2_cleaned

In [46]:
len(set(url1_cleaned) & set(url2_cleaned)) # 285 exact matches

285

In [56]:
# merge
data_merged_tmp = pd.merge(data_merged, scholarship, how = 'left', left_on = 'WEBADDR_cleaned', right_on = 'link_cleaned')
data_merged_tmp.head()
data_merged_tmp.to_csv('Data/Data Merged tmp.csv', index = False)

In [57]:
data_merged = data_merged_tmp
data_merged.to_csv('Data/Data Merged.csv', index = False)

# adding tuition

In [24]:
charges = pd.read_csv('Data/ic2017_ay.csv')
charges.shape

(4281, 235)

In [5]:
data_merged = pd.read_csv('Data/Data Merged.csv')

In [27]:
data_merged_tmp = pd.merge(data_merged, charges, how = 'left', on= 'UNITID')
data_merged_tmp.shape
data_merged_tmp.to_csv('Data/Data Merged tmp.csv', index = False)

In [28]:
data_merged = data_merged_tmp
data_merged.to_csv('Data/Data Merged.csv', index = False)

# big merge

In [6]:
adm = pd.read_csv('Data/adm2017.csv')
adm.shape #(2075, 68)
adm.head()

,UNITID,ADMCON1,ADMCON2,ADMCON3,ADMCON4,ADMCON5,ADMCON6,ADMCON7,ADMCON8,ADMCON9,...,XACTCM75,ACTCM75,XACTEN25,ACTEN25,XACTEN75,ACTEN75,XACTMT25,ACTMT25,XACTMT75,ACTMT75
0,100654,1,2,1,2,3,2,1,1,3,...,R,19.0,R,14.0,R,20.0,R,15.0,R,18.0
1,100663,1,3,1,1,3,3,1,3,3,...,R,28.0,R,22.0,R,31.0,R,21.0,R,26.0
2,100706,1,2,1,1,3,2,1,1,3,...,R,31.0,R,25.0,R,33.0,R,24.0,R,29.0
3,100724,1,3,2,3,3,3,1,1,3,...,R,20.0,R,15.0,R,19.0,R,14.0,R,19.0
4,100751,1,2,1,1,3,3,1,1,3,...,R,32.0,R,23.0,R,33.0,R,21.0,R,29.0

In [9]:
ef2017b = pd.read_csv('Data/ef2017b.csv')
print(ef2017b.shape)#
ef2017b.head()

(176749, 22)

,UNITID,EFBAGE,LINE,LSTUDY,XEFAGE01,EFAGE01,XEFAGE02,EFAGE02,XEFAGE03,EFAGE03,...,XEFAGE05,EFAGE05,XEFAGE06,EFAGE06,XEFAGE07,EFAGE07,XEFAGE08,EFAGE08,XEFAGE09,EFAGE09
0,100654,1,412,1,R,2170,R,3165,R,259,...,R,5335,R,666,R,2429,R,3572,R,6001
1,100654,1,112,2,R,1990,R,2724,R,144,...,R,4714,R,324,R,2134,R,2904,R,5038
2,100654,1,312,5,R,180,R,441,R,115,...,R,621,R,342,R,295,R,668,R,963
3,100654,2,999,1,R,1903,R,2758,R,116,...,R,4661,R,271,R,2019,R,2913,R,4932
4,100654,2,999,2,R,1858,R,2576,R,99,...,R,4434,R,222,R,1957,R,2699,R,4656

In [10]:
ef2017c = pd.read_csv('Data/ef2017c.csv')
print(ef2017c.shape)#
ef2017c.head()

(39500, 7)

   UNITID  EFCSTATE  LINE XEFRES01  EFRES01 XEFRES02  EFRES02
0  100654         1     1        R      667        R     524.0
1  100654         5     5        R        7        R       6.0
2  100654         6     6        R       22        R      16.0
3  100654         8     8        R        4        R       3.0
4  100654        10    10        R        1        R       0.0